Revit 2024 API
ElementId.GetHashCode Method
 Gets the value of the id as hash code
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override int GetHashCode()
Visual Basic
Public Overrides Function GetHashCode As Integer
Visual C++
public:
virtual int GetHashCode() override
See Also
ElementId Class
Autodesk.Revit.DB Namespace